Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
/// ----------------------------------------------------------------------
/// \brief    Inicia la recepcio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    bufferSize: Tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::receive_IRQ(
	uint8_t *buffer,
	unsigned bufferSize) {

	if (_state == State::ready) {

		_state = State::receiving;

		_rxBuffer = buffer;
		_rxCount = 0;
		_rxMaxCount = bufferSize;

		_usart->CR1 |=
			USART_CR1_RE |              // Habilita la recepcio
			USART_CR1_PEIE |            // Habilita interrupcio PE
			USART_CR1_RXNEIE_RXFNEIE |  // Habilita interrupcio RXNE
			USART_CR1_RTOIE;            // Habilita interrupcio RTO

		return Results::success;
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Results::busy;

	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Transmiteix un bloc de dades utilitzant DMA.
/// \param    devDMA: Dispositiu DMA.
/// \param    buffer: Buffer de dades.
/// \param    length: El nombre de bytes a transmetre.
/// \return   El resultat de l'operacio
///
eos::Result UARTDevice::transmit_DMA(
    dma::DMADevice *devDMA,
    const uint8_t *buffer,
    unsigned length) {

    if (_state == State::ready) {

        _state = State::transmiting;

        _txBuffer = buffer;
        _txCount = 0;
        _txMaxCount = length;

        // Habilita comunicacio per DMA
        //
        _usart->ICR = USART_ICR_TCCF;   // Borra el flag de transmissio complerta
        _usart->CR1 |= USART_CR1_TE;    // Habilita transmissio
        _usart->CR3 |= USART_CR3_DMAT;  // Habilita DMA

        // Inicia la transferencia per DMA
        //
        devDMA->setNotifyEvent(_dmaNotifyEvent, true);
        devDMA->start(buffer, (uint8_t*)&(_usart->TDR), _txMaxCount);

        return Results::success;
    }

    else if ((_state == State::transmiting) || (_state == State::receiving))
        return Results::busy;

    else
        return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Reb un bloc de dades utilitzan DMA.
/// \param    devDMA: El dispositiu DMA.
/// \param    buffer: El buffer de dades.
/// \param    bufferSize: El tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::receive_DMA(
    dma::DMADevice *devDMA,
    uint8_t *buffer,
    unsigned bufferSize) {

	return Results::error;
}


/// ----------------------------------------------------------------------
/// \brief    Procesa les interrupcions.
///
#if defined(EOS_PLATFORM_STM32F7)
void UARTDevice::interruptService() {

    // Interrupcio TXEFE (FIFO/TX empty)
    //
    if ((_usart->CR1 & USART_CR1_TXEIE) && (_usart->ISR & USART_ISR_TXE)) {

        if (_txCount < _txMaxCount) {
            _usart->TDR = _txBuffer[_txCount++];
            if (_txCount == _txMaxCount)
                ATOMIC_MODIFY_REG(_usart->CR1, USART_CR1_TXEIE, USART_CR1_TCIE);
        }
    }

    // Interrupcio TC (Transmission complete). Nomes en l'ultim caracter transmes
    //
    if ((_usart->CR1 & USART_CR1_TCIE) && (_usart->ISR & USART_ISR_TC)) {

        _usart->ICR |= USART_ICR_TCCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_TE);
        notifyTxCompleted(_txBuffer, _txCount, true);
        _state = State::ready;
    }

    /// Interupcio FIFO/RD not empty
    //
    if ((_usart->CR1 & USART_CR1_RXNEIE) && (_usart->ISR & USART_ISR_RXNE)) {

        if (_rxCount < _rxNaxCount) {
            _rxBuffer[_rxCount++] = _usart->RDR;
            if (_rxCount == _rxMaxCount) {
                ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
                notifyRxComplete(_rxBuffer, _rxCount, true);
                _state = State::ready;
            }
        }
    }

    // Interrupcio RX timeout
    //
    if ((_usart->CR1 & USART_CR1_RTOIE) && (_usart->ISR & USART_ISR_RTOF)) {

        _usart->ICR |= USART_ICR_RTOCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
        notifyRxCompleted(_rxBuffer, _rxCount, true);
        _state = State::ready;
    }
}

#elif defined(EOS_PLATFORM_STM32G0)
void UARTDevice::interruptService() {

	auto CR1 = _usart->CR1;
	auto CR3 = _usart->CR3;
	auto ISR = _usart->ISR;

	// Comprova de forma rapida si hi ha errors
	//
	if (ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE)) {

		// Comprova si es un error PARITY
		//
		if ((ISR & USART_ISR_PE) && (CR1 & USART_CR1_PEIE)) {

			// Borra el flag
			//
			_usart->ICR = USART_ICR_PECF;
		}

		// Comprova si hi ha error FRAME
		//
	    if ((ISR & USART_ISR_FE) && (CR3 & USART_CR3_EIE)) {

			// Borra el flag
			//
	    	_usart->ICR = USART_ICR_FECF;
	    }

	    // Comprova si es un error NOISE
	    //
	    if ((ISR & USART_ISR_NE) && (CR3 & USART_CR3_EIE)) {

			// Borra el flag
			//
	    	_usart->ICR = USART_ICR_NECF;
	    }

		// Comprova si es un error OVERRUN
		//
		if ((ISR & USART_ISR_ORE) &&
			(CR1 & USART_CR1_RXNEIE_RXFNEIE) &&
			(CR3 & (USART_CR3_RXFTIE | USART_CR3_EIE))) {

			// Borra el flag
			//
			_usart->ICR = USART_ICR_ORECF;
		}
	}

	// No hi han errrors
	//
	else {

		// Transmissio amb el FIFO activat
		//
		if (CR1 & USART_CR1_FIFOEN) {

		}

		// Transmissio amb el FIFO desactivat.
		///
		else {

			// Interrupcio 'TXE'
			//
			if ((CR1 & USART_CR1_TXEIE_TXFNFIE) && (ISR & USART_ISR_TXE_TXFNF)) {

				if (_txCount < _txMaxCount) {
					_usart->TDR = _txBuffer[_txCount++];
					if (_txCount == _txMaxCount) {

						ATOMIC_CLEAR_BIT(_usart->CR1,
							USART_CR1_TXEIE_TXFNFIE); // Deshabilita interrupcio TXE
						ATOMIC_SET_BIT(_usart->CR1,
							USART_CR1_TCIE);          // Habilita interrupcio TC
					}
				}
			}

			// Interrupcio 'TC'. Nomes en l'ultim caracter transmes.
			//
			if ((CR1 & USART_CR1_TCIE) && (CR1 & USART_CR1_TCIE)) {

